[
  {
    "url": "https://nftnewstoday.com/2023/11/20/readygg-onboards-15-million-web2-players-into-web3-in-partnership-with-aptos-labs/",
    "title": "READYgg onboards 15 million web2 players into web3 in partnership with Aptos Labs",
    "time": "November 20, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nGaming\nGaming, Press Release\nREADYgg onboards 15 million web2 players into web3 in partnership with Aptos Labs\nBy Press Release November 20, 2023\nMillions of players will enter web3 gaming thanks to a new partnership between READYgg and Aptos Labs realized through READYgg’s robust and talented network, all on Aptos, the blockchain with the fastest time-to-finality necessary for seamless gameplay. As a result of the new partnership, up to 15 million web2 gamers will migrate to web3 and Aptos. Starting November 20, players can be whitelisted for early access to the new releases launching on December 6. READYgg has already signed over 20 major web2 publishers, representing a library of 2,000 games played by over 200m monthly active users. Four of these web2 publishers will now operate on the Aptos blockchain by the end of 2023, with a minimum of a dozen more to follow next year. Titles will include Runestone Keeper, a roguelike dungeon crawler game (PC/Android/iOS), Rescue Robots Sniper Survival (Android), a first-person action game, Minijuegos, a hypercasual platform, and ToroFun, a browser-based social gaming portal. All these titles will feature web3 elements, such as non-fungible tokens (NFTs), while Minijuegos and ToroFun will also boast an innovative NFT-based loyalty system. In addition to benefiting from a performant blockchain with speed and asset portability built-in, publishers joining the READYgg / Aptos ecosystem will enjoy potential funding or grants through the READYgg $RDYX token – known as “The Gamer’s Token” – and predictable Aptos usage fees empowering publishers to run web3 components with less exposure to price volatility. “It is difficult to overstate just how overjoyed we are about this commitment from Aptos Labs,” said David S. Bennahum, CEO \u0026 Co-Founder of READYgg. “Bridging web2 games to web3 has always been our goal, which is why we’ve built a range of tools traditional publishers can use to seamlessly reach a web3 audience and bring their typical users into the world of on-chain gaming.” “Aptos Lab’s expertise will ensure that millions of web2 gamers can get to grips with web3 very quickly, without having to contend with any kind of imposing learning curve.” said Christina Macedo, COO \u0026 Co-Founder of READYgg. “They can just have fun, and that’s all that matters” “This partnership with READYgg will accelerate the delivery of studio-quality web3 games, user experiences, and compelling ownable assets,” said Mo Shaikh, co-founder \u0026 CEO of Aptos Labs. From the start, READYgg’s vision has been to enable billions of people—developers, players and content creators, in particular in emerging markets—to have the opportunity to access and appreciate web3 easily through games and game economies. READYgg’s tools and ecosystem democratize access to web3 game creation and opens a path to true mass adoption and scale into web3. The partnership with Aptos Labs will expand what’s possible in web3 gaming and deliver unparalleled UX on par or better than anything worth playing on web2. About Aptos Labs Aptos Labs, co-founded by Mo Shaikh and Avery Ching, is dedicated to creating better network tooling and seamless usability to bring the benefits of decentralization to the masses. Having now raised over $400M, Aptos Labs is backed by top-flight investors, including a16z, Jump Crypto, Binance Labs, Dragonfly, PayPal Ventures, Andreessen Horowitz and Franklin Templeton Investments About Aptos Network Aptos is a next-generation Layer 1 blockchain. Aptos’ breakthrough technology and programming language, Move, are designed to evolve, improve performance and strengthen user safeguards. Please visit https://www.aptosfoundation.org for more information on the Aptos blockchain. About READYgg READYgg uses blockchain and game development technology to connect and empower games. The company specializes in supporting publishers and studios as they evolve to web3 while providing the best possible experience to their game communities. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Press Release",
      "Gaming"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/14/worldline-sets-sights-on-metaverse-e-commerce-market/",
    "title": "Worldline Sets Sights on Metaverse E-commerce Market",
    "time": "December 14, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nMetaverse\nmetaverse\nWorldline Sets Sights on Metaverse E-commerce Market\nBy David Andrews December 14, 2023\nWorldline, a global leader in payment solutions, is expanding its Metaverse presence. This expansion, through its Metaverse Shopping Mall and the addition of Spatial, aims to enhance graphical quality and accessibility across various devices, including desktop, mobile, and VR. With the Metaverse e-commerce market projected to reach a staggering US$2.6 trillion by 2030, as estimated by McKinsey, this platform extension aims to offer a competitive edge to merchants lacking a Metaverse presence. Innovative Engagement in the Metaverse Following the successful launch of the Worldline Metaverse Shopping Mall in Decentraland earlier this year, Worldline’s integration of Spatial marks creating a comprehensive Metaverse Shopping Hub. Spatial’s Season 2 introduces new customer engagement methods through gaming. For instance, merchants can host virtual scavenger hunts where customers collect digital eggs for NFT rewards. Source Spatial Worldline Shopping Mall Furthermore, this initiative signifies the start of inventive customer interaction methods in the Metaverse. By diversifying engagement strategies, Worldline aims to strengthen the relationships between merchants and customers in this new digital realm. The Worldline Metaverse Shopping Mall, complemented by additional Metaverse Advertising, Phygital Experiences, and Augmented Reality packages, could help merchants establish and expand their Metaverse presence. Enhanced Accessibility and Payment Solutions Spatial’s integration notably improves accessibility, allowing entry into the Metaverse via VR headsets and smartphones, not just computers. Worldline’s platform supports various payment methods, including traditional cards, E-wallets like PayPal, and mobile payments through Apple Pay. Sascha Muenger, Head Competence Center Crypto-Related Products \u0026 Metaverse at Worldline, expressed enthusiasm about this new phase, saying, “We are delighted to present the second season of our Metaverse Shopping Mall in Spatial. This important milestone gives us the opportunity to create a new shopping experience together with some of our most innovative customers and take another step towards commerce solutions in the Metaverse.” The launch also signals a geographical expansion. PAYONE, a collaboration between Worldline and the German Savings Banks Association (DSV Group), will distribute the Worldline Metaverse solution in Germany and Austria in the first quarter of 2024. This move is expected to bring this global innovation to vital local markets, further scaling the Worldline Metaverse Shopping Mall and introducing more merchants to the Metaverse as a new channel for commerce. Final Thoughts As the Metaverse emerges as a significant venue for digital commerce, businesses and individuals will begin to adapt and embrace the new possibilities presented by this interconnected virtual world. By staying informed and engaged with the latest innovations and trends, merchants can make the most of every opportunity available to them in the ever-evolving landscape of the Metaverse. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "metaverse",
      "Metaverse"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/11/23/funtoken-partners-with-astra-nova-ushering-in-a-new-era-of-metarpg-gaming/",
    "title": "FUNToken Partners with Astra Nova: Ushering in a New Era of MetaRPG Gaming",
    "time": "November 23, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nGaming\nGaming, Press Release\nFUNToken Partners with Astra Nova: Ushering in a New Era of MetaRPG Gaming\nBy Press Release November 23, 2023\nFUNToken is proud to announce its strategic partnership with Astra Nova, a leading MetaRPG game developer in the MENA \u0026 SEA regions. This partnership marks a significant step in the evolution of Web3 Gaming, with both companies committed to redefining the gaming experience through innovative technology and community engagement. The integration of $FUN tokens into Astra Nova’s Web3 RPG game, built on the powerful Unreal Engine 5, represents a milestone in gaming. This integration will provide a unique utility for $FUN token holders and enhance the gaming experience. $FUN token stakers can expect access to exclusive features such as special levels, community rewards, and early access to new content within Astra Nova’s ecosystem. This initiative is designed to offer a richer and more immersive gaming experience to the $FUN community. FUNToken and Astra Nova will engage in coordinated marketing campaigns to amplify their presence in the gaming world. These campaigns will include social media promotion, community engagement programs, and exclusive events to increase both brands’ visibility and participation. The partnership is about building a robust community around Astra Nova and FUNToken. The collaboration will feature interactive events, AMAs, and special contests, fostering a sense of belonging and rewarding community members for their support and engagement. We are excited to see this partnership’s impact on the gaming industry and look forward to the future. About FUNToken FUNToken’s objective is simple – harnessing the power of blockchain tech to create “trustless” gaming ecosystems that users can rely on and operators can implement seamlessly. FUNToken is backed by the best in the business – FreeBitco.in is committed to fueling FUNToken’s efforts of making non-custodial gaming an industry standard. Website | X | Discord | Portfolio | Telegram | Medium | Reddit | LinkedIn About Astra Nova Astra Nova is a MENA \u0026 SEA-focused Web3 Gaming company focused on creating lasting community value for avid gamers and NFT enthusiasts. The company is building a web3 RPG free-to-play game, powered by Hedera and built on UnrealEngine 5, based on the core Web3 principle of blockchain interoperability \u0026 transparency. Bringing this to life is a team of industry veterans in game development, award-winning creatives \u0026 leaders in brand marketing. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Press Release",
      "Gaming"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/10/04/music-icon-carl-cox-takes-over-sensorium-galaxy/",
    "title": "Music Icon Carl Cox Takes Over Sensorium Galaxy",
    "time": "October 4, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nMusic\nFeatures, Music\nMusic Icon Carl Cox Takes Over Sensorium Galaxy\nBy Jayden Smith October 4, 2023\nSensorium has announced the debut virtual show of electronic music legend Carl Cox in the Sensorium Galaxy. The exclusive 30-minute performance, aptly named “Intermundium,” will take place on Friday, October 27, at 7 p.m. GMT. This groundbreaking event will be available to music and technology enthusiasts worldwide, free of charge. Carl Cox Takes Center Stage in the Metaverse” Carl Cox, an iconic figure in the electronic music world, has consistently been a pioneer since the early days of acid house and techno. His influence extends from his DJ wizardry to his iconic releases such as ‘F.A.C.T’ and ‘Electronic Generations.’ Beyond his DJ career, he has made significant contributions as a label owner, producer, and remixer, nurturing emerging talent and leaving an indelible mark on the dance music landscape. Carl Cox’s involvement in this venture marks a significant moment for Sensorium Galaxy. Sensorium Galaxy is a dynamic metaverse comprised of diverse virtual worlds, with PRISM being the hub dedicated to electronic music. It’s in PRISM that avatars of real-life and virtual DJs provide continuous musical experiences. “Intermundium” is intricately designed to harness PRISM’s unique characteristics, creating an anomaly location where sound frequencies can transform space. Pushing Boundaries In this virtual realm, Carl Cox, in digital form, takes control with his tech-house beats, setting everything in motion, from volcanic streams to futuristic concert modules, captivating virtual inhabitants and show guests in an endless dance. Carl Cox shared his excitement, stating, “I’ve always been about pushing boundaries, sharing the love of music, and enhancing electronic music culture. I truly understood what was possible when I first saw my avatar and literally did a double-take! It has been really interesting to see things develop to the point where I can share my experiences with like-minded individuals anywhere on Earth – or beyond!” Accessing ‘Intermundium Access to “Intermundium” will be available through various platforms, including the Sensorium Galaxy Website (2D Stream), YouTube (2D Stream), App Store, Google Play apps (2D Stream), and Steam (Full-fledged VR). An immersive VR-360 version will be exclusively available on the PICO Store for one month, providing a unique viewing experience. The show will also be broadcasted on Sensorium’s TikTok Live (2D Stream) during the premiere. Don’t miss the opportunity to experience the fusion of music and technology in this unprecedented virtual performance by Carl Cox. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Music",
      "Features"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/22/veyond-metaverses-meta-quest-3-fusion-a-new-era-in-digital-surgery/",
    "title": "Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery",
    "time": "December 22, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nMetaverse\nmetaverse, Top Stories\nVeyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery\nBy David Andrews December 22, 2023\nVeyond Metaverse, an emerging player in AI XR healthcare, has introduced 5D Digital Surgery, advancing the field . Their recent successful integration of Meta Quest 3 into their XR (Extended Reality) 5D Digital Surgery platform marks a significant milestone in surgical technologies. This collaboration enhances accessibility and affordability, enhancing surgical procedures and highlighting progress in Metaverse Healthcare. Enhancing Surgery with XR 5D and Meta Quest 3 XR 5D Digital Surgery combines real and virtual environments for immersive and precise surgical procedures. Powered by AI, this platform opens up new possibilities in healthcare. The Meta Quest 3, renowned for its high-resolution display and advanced cameras, integrates into the platform. Dr Thierry Flam, a skilled surgeon in Paris, conducted successful tests with the Meta Quest 3, highlighting its benefits, such as easy mode switching and clear audio without needing earplugs. Dr Flam’s tests also revealed the headset’s potential to enhance surgical collaboration and training through AI-powered real-time translation features. This integration and testing signify a significant advancement in digital healthcare technology. Expanding Access and Pioneering Future Healthcare Solutions Veyond Metaverse remains committed to democratizing healthcare. Their notable achievements include conducting the first successful XR digital surgery over 8,500 kilometres and establishing XR Digital Surgery training centres in collaboration with RapiDiagnostics S.A. These centers aim to overcome barriers in healthcare by focusing on advanced surgical training and telemedicine. Following the successful tests, Meta Quest 3 will undergo further evaluations, with a specific emphasis on its see-through capability. Once these tests are completed successfully, the headset will be deployed in a live XR 5D Digital Surgery scenario at Shwe La Min Hospital’s XR Operating Room Center. Veyond Metaverse’s dedication to innovation and accessibility in healthcare is evident in their continuous efforts to develop and integrate advanced XR and AI technologies like the Meta Quest 3. Their ultimate goal is to transform healthcare delivery globally. Combining virtual environments with traditional healthcare practices, Metaverse Healthcare could offer enhanced patient engagement, wider access to care, and more adaptable service delivery while being cost-effective. Author\nPrevious Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "metaverse",
      "Metaverse",
      "Top Stories"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/22/cardano-foundation-and-petrobras-unite-for-blockchain-education-initiative/",
    "title": "Cardano Foundation and Petrobras Unite for Blockchain Education Initiative",
    "time": "December 22, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nWeb3\nweb3\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative\nBy Gabrielle Rodriguez December 22, 2023\nThe Cardano Foundation has partnered with Petrobras, Brazil’s state-owned energy company, to launch a new blockchain education program. This initiative aims to broaden the understanding and use of blockchain technologies within Petrobras. The program will include workshops for Petrobras employees, utilizing content from the Cardano Academy and delivered through Petrobras University. The curriculum will cover blockchain’s potential and diverse applications, enriched with interactive quizzes and NFTs. Blockchain Literacy and Evolving NFTs Two initial workshops were conducted in the Metaverse, focusing on regulatory aspects of blockchain in both global and Brazilian contexts. The Cardano Academy, developed by the Cardano Foundation, provides a solid foundation for these educational efforts. Petrobras will adapt this content for its internal training programs, accessible to over 40,000 employees. Participants will receive a certificate after completing the course, and the first 500 will also get a unique NFT, evolving with their progress in the training. Future Prospects and Collaborative Goals Frederik Gregaard, CEO of the Cardano Foundation, highlighted the importance of blockchain education across different sectors. He said, “Our partnership with Petrobras—a Fortune 500 company…highlights both the appetite for blockchain education and the growing reach of the Cardano Foundation and its mission.” Petrobras also expressed optimism about the partnership, seeing it as a crucial step in integrating blockchain technology within the energy sector and emphasizing the central role of education in this innovative partnership. The collaboration aims to further blockchain understanding through employee education and explore new blockchain applications in the energy sector. This partnership is an example of integrating blockchain technology into various industry sectors, paving the way for future advancements and innovations. Author\nPrevious Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Web3",
      "web3"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/11/29/caw-debuts-nft-exhibition-in-the-metaverse-with-the-launch-of-museum-of-caw-art-moca/",
    "title": "CAW debuts NFT Exhibition in the Metaverse with the Launch of Museum of CAW Art (MoCA)",
    "time": "November 29, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nArt\nArt, Press Release\nCAW debuts NFT Exhibition in the Metaverse with the Launch of Museum of CAW Art (MoCA)\nBy Press Release November 29, 2023\nDubai-initiated NFT and web3-centric start-up Caffeine And Women or CAW Movement adds another feather in its cap with the upcoming launch of MoCA (Museum of CAW Art) in the metaverse to honor emerging artists in UAE, GCC and other countries. It is also inviting all art lovers, NFT enthusiasts or web3 builders to be part of this unique, immersive opening on 6 December 2023 at 7.00pm UAE time by joining in its invite list here. Founded in 2022, the CAW Movement (CAWMVMT) supports women artists by empowering and helping them turn their art into NFTs and giving it visibility in the web3 space. Through word-of-mouth and active participation in various events, exhibitions and social platforms, the community has steadily grown to attract artists and NFT collectors from around the world. With this, it was only apt that this globally-accessible space be created. From Warhol To Web3 What makes MoCA really unique is it being the first destination which showcases NFTs that are actually physical pieces as well. The works displayed comprises unique collections ranging from portraiture featuring coffee elements to the soon-to-be-launched ‘Pop Art – “P3.OP Art Collection” which features inspiration from Warhol to Web3. Saluting The Exhibiting Artists A special thanks goes out to the exhibiting artists Sadie Sulaiman, Georgi Levchev, Amira Al Zein, Lama Lahham, Rubab Zahra, Mai Aljboor, Asmaa Thabet, Abeer Baghdadi, Lipika Das, Shelina Khimji, Bogdan Oana, Puja aka weirdo1800, Michel Gebrael, Nayma Yasir, Maya Cochrane, Monica Alvarez, Anis El Jamal, Sonu Sultania, Pauline Burnside, and NFT collectors Thirunelakanden and Meng Chan Shu for their contribution towards the opening of MoCA. Live 1/1 Nft Mint Experience In The Metaverse To make MoCA VIP Opening more eventful, the team will do LIVE NFT drops and are also inviting the guests to grab their VR headsets for a more immersive experience. To register for the launch, simply click here and the invitation link will be sent directly to your inbox. “MoCA is a tribute to our artists, collectors, community members and NFT/art lovers all around the world!” CAW Founder, Shirin Van Dort “All the beautiful creations now have a home-away-from-home. And it welcomes everyone 24/7!” CAW Co-founder, Leslie aka Lezthelion About CAW Movement CAW Movement (Caffeine And Women) proudly introduces an extraordinary NFT project that seamlessly blends the essence of coffee culture, the creativity of art, and the empowerment of women within the web3 space and beyond. With its core mission to shed light on the inner workings of the specialty coffee industry and onboard emerging artists into web3, CAW Movement unveils exceptional projects that bring this vision to life. CAW was launched early 2022 and its community of artists and supporters have been growing ever since. They are one of the first NFT projects that hosted IRL exhibitions with physical art pieces at the coffee roastery in Dubai, and now they are taking the exhibition into the metaverse. Website: caffeineandwomen.art X (Twitter): @cawmvmt Contact Shirin Van Dort Talkto@caffeineandwomen.art Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Art",
      "Press Release"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2022/12/07/how-to-build-your-first-nft-collection/",
    "title": "How to Build Your First NFT Collection",
    "time": "December 7, 2022",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nEducation\neducation, Latest News, NFTs\nHow to Build Your First NFT Collection\nBy Bash Sarmiento December 7, 2022\nNearly everyone has heard of NFT since it has permeated even the most remote reaches of the Web. It’s still in its early phases and expanding exceptionally quickly. To build your first NFT collection and solidify a position in this industry before it becomes oversaturated, you must learn how to create and market your own NFTs. This article will help you through the process of it. What are NFTs? NFTs, or non-fungible tokens, are digital assets that reside on the blockchain. Just like other decentralized applications that run on a blockchain, NFTs also operate on Web3 browsers, which is helpful in keeping remote security. Each NFT is unique, and one cannot trade it for another cryptocurrency, unlike other cryptos where you can exchange a fungible acquisition for another of similar value. It contains a digital signature to demonstrate ownership and authenticity. Cross-referencing the metadata with openly available blockchain records is another way to confirm that someone is the owner of an authentic NFT. NFTs thrive on scarcity. They become more valuable over time since they include a digital signature. According to fundamental economic theory, a product or service’s price will increase when there is a shortage compared to demand. That explains why many people dream of owning an NFT because doing so gives them the same pride as buying a Van Gogh painting. How to Build Your First NFT Collection Whether music, a painting, or a piece of literature, you can turn any digital file into an NFT. Below, we curated some steps to build your first NFT collection, upload it, and sell it. Create a digital art draft There are no guidelines for digital art, so you can be as creative as you like without adhering to any particular technique. You can use programs like Photoshop, Affinity Pro, and Corel Painter to create digital art. However, you can hire freelancers online if you want expertly curated work. Before getting your art into an NFT platform, you must be aware that the marketplace must support the file you’re uploading. Most platforms support TXT, PNG, JPG, MP4, and GIF files. Choose a blockchain The next step is to mint the digital artwork into an NFT after choosing which one to utilize. Minting means creating a digital file into a cryptocurrency collectible or digital asset kept on the blockchain. And the most crucial stage, which affects the cost of minting an NFT and the security of your NFT, is choosing an appropriate blockchain. Additionally, because specific wallets are incompatible with certain blockchains, you might be unable to move your NFT to your digital wallet if you mint it on a less well-known blockchain. Before choosing a blockchain for your NFT, know the best and most well-known ones first. Ethereum The most widely used blockchain is Ethereum, which is known for being straightforward and user-friendly. Many popular NFT marketplaces are based on the Ethereum network, including OpenSea, Rarible, SuperRare, and others. However, you will need to pay a significant amount known as gas costs to validate any transaction on the Ethereum blockchain. Because of this, Ethereum is frequently the most expensive platform for producing NFTs. Polygon Using Polygon, you may mint NFTs on OpenSea, one of the largest marketplaces. Unique to Polygon is the ability to mint NFTs without paying anything upfront. The platform presupposes lazy minting as the default strategy, which means the person purchasing your NFT will be responsible for paying the fees to have it minted and will charge you 2.5% of every transaction you perform on the network Tezos Tezos can be the solution you’re looking for if you’re worried about how blockchains will affect the environment because it has been shown to use 200,000 times less energy than competing systems and produce a smaller overall carbon footprint. Other than that, Tezos is an excellent blockchain for minting NFTs, even for beginners, because minting NFTs on it is quicker, cheaper, and more efficient than on Ethereum. Prepare and fill up your crypto wallet As indicated, you will have to pay a modest sum of tokens as transaction costs to sell your NFTs. You’ll need to create a wallet that supports your preferred blockchain to achieve that. Additionally, in the world of NFT, your wallet address serves as your identification. Use it to set up a profile on online stores and other decentralized applications. The best crypto wallets out there are Coinbase, MetaMask, and Rainbow. Create a marketplace account After finishing the prior procedures, select a marketplace where you will present all of your work. There are a few things to think about in advance: All devices should be able to access the platform for convenience. It should support various wallets and payment methods for a simple transaction. The market should support token fractionalization. It should have a robust verification procedure to safeguard your assets. It should optionally offer specific user incentives. OpenSea For all kinds of NFTs, OpenSea is well-liked and straightforward to operate. OpenSea now offers a slow mint option, whereas the Ethereum blockchain is infamous for demanding exorbitant service costs, or “gas.” Without having to pay for gas, the artist can upload their creation, “mint” it to their profile, and then put it for sale. The gas costs will be covered by the collector when they buy it. Rarible Book, music, digital art, and movie creators can all use Rarible to mint their NFT works. There are some amusing options, like the option only to provide buyers access to the entire project while allowing visitors to have a “sneak peek” of your product, but limit the whole project to the purchasers. Holaplex Artists and creators report that the Solana blockchain is extremely quick, has excellent performance, and is cost-effective with meager fees, despite Solana receiving mixed reviews from Ethereum aficionados. Solana is known as a new, less harmful alternative to Ethereum due to its speed and efficiency, which also reduces energy consumption. Objkt Objkt, first developed as a secondary market, now enables artists and producers to make money directly from their work on its site. Sasha Stiles and Ana Maria Caballero, co-founders of the VerseVerse, use it and other literary NFT creators. Get your first NFT minted and listed After creating the digital artwork, connecting it to a marketplace, picking a blockchain, and purchasing some cryptocurrency, all that’s left to do is mint it. It is the process of turning a digital file into a blockchain-based digital asset. Your digital asset cannot be erased or modified once registered on the blockchain. You should be able to find step-by-step instructions for posting your digital file on your preferred NFT marketplace, and once minted, your digital artwork is now open for sale. Selling your NFTs Now that you know how to make an NFT, you must set up the sales procedure. You should factor fees into the minimum price calculation. If you set the price too low, you risk losing money on sales. It is frequently impossible and costly to mint or sells an NFT. There may be a commission charge for the sale and a transaction fee when transferring from the buyers’ wallet to yours. Due to the erratic nature of bitcoin values, fees might change. It would be best if you considered the cost of minting and selling your NFT to ensure you can sell it for a price that pays for all expenses. After you complete this process, your NFT will be listed, and other collectors may begin bidding on your assets. If your item is unique, you may sell your NFT. Bottom Line If you’re a beginner to NFTs, it’s justified that you may feel overwhelmed with the process. However, there’s a big misconception that you must be technical to participate in crypto. Instead, consider NFTs a fun approach to entering the market that doesn’t require coding knowledge. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "education",
      "NFTs",
      "Latest News",
      "Education"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2022/12/06/learn-metaverse-skills-at-an-accredited-university/",
    "title": "Learn metaverse skills at an accredited University for Free",
    "time": "December 6, 2022",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nEducation\neducation, Latest News\nLearn metaverse skills at an accredited University for Free\nBy James Neeson December 6, 2022\nDo you want to learn the metaverse skills needed to get ahead in the unfolding Web3? If so, you may want to look at signing up for the free course currently being offered by the University of Nicosia (UNIC) in Cyprus. According to the UNIC website, the course is “delivered on-chain and in the metaverse”. It began in October and continues into January. Although the course is well underway, it is self-paced, so if you have enough time to set aside over the holidays, you can still sign up and complete the Metaverse certification. Furthermore, the course material is uploaded to Github as the curriculum progresses. You can find it here. The course, META 501: NFTs and the Metaverse come with an official “University of Nicosia Certificate of Completion” NFT, on the Ethereum blockchain. To get your Metaverse certificate, you must complete the course and pass the multiple-choice test at the end of the period. Lectures are given by the UNIC faculty, headed by Professor George Giaglas, and Punk6529, a leading NFT and Metaverse investor, who April opened a Metaverse museum. Learning occurs in virtual reality auditoriums within “OM”, an Open Metaverse built by Punk6529. There is also a veritable array of star guest lecturers, including big hitters such as Keith Grossman, President of Forbes, Yat Siu, Chairman of Animoca Brands, and NFT artist, Beeple. There are too many to name here, but the list includes trailblazers, influencers and companies investing in the Metaverse and NFT space. You can browse the guest lecturers and their expertise on the university website. Why take the “NFTs and the Metaverse” course? The Metaverse is the next evolution of the internet and will majorly impact many aspects of society, including business, work, governing, personal and social relationships. Moreover, an integral part of the coming Metaverse is NFTs. Therefore, the modules included in META 501 will help learners understand the skill sets needed to succeed in the Metaverse and give them an introductory foundation of the basics behind the theory and current use cases for the emerging technologies surrounding both. You may think that the Metaverse is a long way off, and yes, a fully functional inter-operable metaverse is still not technologically feasible but an S\u0026P 500 company, Gartner, predicts that some 25% of people will be active within the evolving Metaverse, for at least one hour a day. What other free courses do UNIC offer? UNIC is also offering a further two free MOOCs (Massive Open Online Courses) starting in the new year. The first MOOC is an introductory course to Decentralized Finance which begins on 9th January 2023. The second offering is BLOC-511DL: Digital Currency, which commences on 6th February 2023. You can find more info on signing up for the DeFi course here and if you wish to enrol in the free Blockchain course check this page out. The OM What modules are included in NFTs and the Metaverse? The first seven weeks are focused on NFTs and include lectures on copyright, provenance, and tax laws concerning NFTs. The Crypto and Generative art NFTs modules cover subjects such as cross-over artists and photography and the history and future direction of generative art. Another module covering gaming NFTs includes lectures on in-game economics, play-to-earn games, and the differences between blockchain and traditional gaming. The second half of the course relates to the NFTs in the Metaverse. The first lectures give you a grounding in the history of the early Metaverse, plus lectures on MMORPGs, virtual reality systems and metaverse social networks. Another set of lectures includes learning about 3D in the Metaverse. Subjects relate to propriety game engines and Web3 standards. Further lectures concentrate on moves to create immersive experiences for users through virtual reality (VR) and augmented reality (AR), extended reality, virtual worlds and how virtual environments will grow. Other subjects taught are metaverse-related business opportunities, business laws, and protecting your brand in the Metaverse. The final lectures relate to web 1 and 2 technology stacks and the future of Web3 technology stacks such as Wed3 apps and Open Standards. About the University of Nicosia The university has a good reputation and is ranked the No. 1 University in the Southern Mediterranean for tuition in English, with Times Higher Education ranking the UNIC at 501#, overall globally. Moreover, it has a long association with blockchain technology, becoming the World’s first university to offer credits for blockchain courses, back in 2014. Currently, the university offers two crypto-related degrees, an MSc in Blockchain and Digital Currency and an MSc in Computer Science – Blockchain Concentration. In addition, it hopes to introduce an MSc in Metaverse Systems in 2023. Afterthoughts on courses to learn metaverse skills As Web3 technology evolves, people will live a mixed reality life, seamlessly moving between the real world and the virtual world. These future immersive worlds will include new digital technology and business, work and social opportunities. The UNIC, NFTs and the Metaverse certificate is an excellent way to develop the Metaverse skills needed to be successful, in virtual environments. The set-up, UNIC, and the lecturers involved combine to give the course weight and authority. Finally, when the course is completed it will still be available for open access. If you are interested in studying the Metaverse, Web3, blockchain and NFTs, you can check out our articles on the free Binance courses and paid courses on Udemy. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "education",
      "Latest News",
      "Education"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/10/24/async-art-confirms-its-decision-to-wind-down-operations/",
    "title": "Async Art Confirms Its Decision to Wind Down Operations",
    "time": "October 24, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nArt\nArt, Top Stories\nAsync Art Confirms Its Decision to Wind Down Operations\nBy Seamus O Connor October 24, 2023\nIn the ever-evolving blockchain landscape, few platforms have made as significant an impact as Async Art. Launched in 2020, Async Art quickly became a hub for innovative artists and musicians, offering a unique platform for creative expression. The platform’s unique selling point was its dynamic approach to digital art. Artists were empowered to create multi-layered, constantly evolving pieces that could evolve over time or be influenced by collectors. This interactive aspect set Async Art apart from other platforms in the blockchain art space. Key Features and Innovations One of Async Art’s most significant contributions to the Web3 community was the Blueprints system. This tool provided artists with a template to create generative NFTs without any coding knowledge. The result was a flurry of iconic projects, including XCOPY’s “Grifters” and “Across the Face” by Osinachi. These projects showcased the potential of the Blueprint system, offering a glimpse of what the future of digital art could look like. The Challenges of a Changing Landscape Despite its successes, Async Art faced numerous challenges. The NFT space has grown exponentially in a short time, leading to a shift in the industry’s motivations. When we launched in Feb 2020, the NFT world was smaller and simpler. Everyone knew each other and there was a genuine sense of altruism all around. I was eager to join and contribute ideas and tech with a community that shared my values of innovation, collaboration, and equity. — Conlan Rios (conlan.eth) 🇺🇦🕊🔺 (@conlan) October 23, 2023 As Async Art’s CEO, Conlan Rios, tweeted, the journey wasn’t without its hurdles. Shifting from an art collector and community builder to a technical platform operator and team leader brought new challenges and responsibilities, some of which were less glamorous than others. “Go where you’re celebrated, not tolerated.” This has been a tough one, but the @AsyncArt team and I have made the hard decision to begin winding down operations. The Closure Announcement After careful consideration, Async Art announced on Oct. 23 that it would be winding down operations over the next few months. This news marked the end of an era for the blockchain art community, but the team was confident that the dynamic and generative art movement would continue to thrive. After much deliberation, it is with heavy hearts that we announce Async Art is winding down operations over the next few months. What Happens to Existing NFTs? Following the closure announcement, one of the most pressing questions was what would happen to the existing NFTs. Fortunately, Async Art had a plan in place. All Async NFTs are secured on IPFS and will continue to exist on-chain. However, the Async Market will no longer support purchases by the end of 2023, and Async Art will stop accepting new submissions starting Oct. 23. Despite the impending closure, Rios assured that the team’s primary goal was to “preserve the works created with [the] platform and ensure [its] remaining team members find new homes to continue pursuing their web3 passions.” Conclusion While Async Art’s closure marks the end of an era, it also serves as a reminder of the platform’s significant contributions to the Web3 community. The legacy of Async Art will continue to inspire and influence the dynamic and generative art movement for years to come. The crypto art community will undoubtedly feel the loss of Async Art, but as the saying goes, “Every end is a new beginning.” As we bid farewell to Async Art, we look forward to the future of digital art and NFTs with anticipation and excitement. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Art",
      "Top Stories"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/20/modex-second-nft-collection-fifa-collect-debut-drop-success/",
    "title": "Modex Rolls Out Second NFT Collection with FIFA+ Collect After Debut Drop Success",
    "time": "December 20, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nCollectibles\ncollectibles, Top Stories\nModex Rolls Out Second NFT Collection with FIFA+ Collect After Debut Drop Success\nBy David Andrews December 20, 2023\nModex’s partnership with FIFA+ Collect Club generated enormous interest by uniting digital art with football fandom, as their exclusive NFT drop sold out in just three hours. The limited edition FIFA+ Collect Club NFT Membership Cards, priced at $999, saw substantial demand during the primary sale phase. Now, Modex has unveiled a range of future benefits for FIFA+ Collect VIP members, plus details about the VIP experiences offered along with their new collection on Opensea. Exclusive Perks for VIP Members Following the hugely successful first drop, Modex has now announced a range of future benefits for FIFA+ Collect VIP members. One such benefit includes a special airdrop scheduled for December 26. VIP members who maintain their membership status on the 26th are in for a treat— they will receive an airdrop containing a key moment from the FIFA Club World Cup Saudi Arabia 2023™. According to their announcement, this airdrop will include two extra special moments that come with the incredible opportunity to get tickets to the FIFA World Cup 2026™ and FIFA Club World Cup 2025™ finals in the USA. Additionally, benefits for VIP cardholders also include being elevated to Adidas Level 4 membership, a privilege usually reserved for those earning over 9k points in Adidas products ($1 equates to 10 points). Modex’s New Collection on OpenSea Further expanding its range of NFT offerings, Modex has unveiled a new drop on OpenSea, issued on the Polygon network. Released on December 19 at 11 AM EST, this collection features 900 NFTs, each highlighting VIP experiences and physical items from the FIFA Club World Cup 2023™. The specific benefits associated with each NFT will be revealed to holders upon minting. The possible benefits of the latest NFT drop by Modex include a host of exclusive items catering to football enthusiasts. Among these are tickets to the esteemed “The Best FIFA Football Awards™,” thus offering an opportunity to partake in one of football’s most notable events. Additionally, VIP visits to the FIFA Museum in Zurich with a FIFA Legend provide an exclusive peek into the sport’s storied past. At the same time, 70 Yellow/Red cards autographed by referees from the FIFA Club World Cup 2023™ in Saudi Arabia contribute an authentic touch. Furthermore, the collection includes 14 Corner Flags, each signed by team captains, and two tournament-used whistles. Finally, the collection boasts 812 uniquely numbered posters, each representing teams from the tournament and available in seven distinct designs. Modex’s partnership with FIFA+ Collect Club, combining digital art and moments from the beautiful game, has sparked tremendous interest in the NFT world. Their initial NFT drop sold out rapidly, highlighting the growing enthusiasm for connecting fans with unique digital and real-world football experiences. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "collectibles",
      "Top Stories",
      "Collectibles"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/05/palm-foundations-45000-grant-artists-patio-by-zsonamaco/",
    "title": "Palm Foundation Announces $45,000 Grant for Artists Featuring at Patio by ZsONAMACO",
    "time": "December 5, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nArt\nArt, Top Stories\nPalm Foundation Announces $45,000 Grant for Artists Featuring at Patio by ZsONAMACO\nBy Gabrielle Rodriguez December 5, 2023\nThe Palm Foundation, dedicated to fostering creative initiatives on the Palm Network, has recently unveiled a substantial grant for artists worth $45,000. The grant will be shared between distinguished artists chosen by the Patio curatorial committee to exhibit at Patio by ZsONAMACO. This outdoor exhibition takes place during the Art Baja California art fair, set for March 7-8, 2024, in San Jose, Baja California. The event is hosted by ZsONAMACO, a leading art fair platform in Latin America, and will showcase various outdoor art installations and sculptures. Set in a truly stunning location, this exhibition attracts thousands of visitors and numerous exhibitors from all over the globe. Fostering Creativity in Digital and Physical Art The grant from the Palm Foundation empowers artists to craft large-scale physical artworks, ensuring their prominence at the event. Additionally, it aims to elevate Patio-curated artists by introducing their creations to the digital world. To do this, each grant recipient is required to mint 3 to 5 NFTs that reflect their physical artwork for the Patio by ZsONAMACO exhibit. Source Art Baja Furthermore, artists receiving the grant will benefit from technical support offered by the Palm Foundation, aiding them in crafting and minting the NFTs that complement their physical artworks. These digital creations will be issued on the Palm Network, a blockchain ecosystem devoted to creators and creativity. Notably, artists retain all intellectual and commercial rights to their work and will also have a choice of commercial platforms if they want to sell their NFTs. The Palm Foundation’s Commitment to Artist Visibility As a non-profit organization, The Palm Foundation is fully committed to boosting the profile of its talented artists. They encourage artists to submit one of their minted NFTs for a Palm DAO community vote, with the most popular artists receiving an additional $1,000 grant. With this, the Palm Foundation continues its mission to amplify the voices of artists and developers as they strive to empower these creative talents. Moreover, this grant program is part of a broader initiative by the Palm Foundation, which includes similar programs for artist residencies in Mexico City and Berlin, offering artists a chance to grow professionally and expand their digital presence. The Palm Foundation’s $45,000 grant offers artists at Patio by ZsONAMACO a fantastic opportunity to showcase their talents on a large scale and step into the ever-evolving world of NFTs. This initiative, bridging traditional physical exhibitions with digital platforms, marks a forward-thinking approach needed for art in the digital age. Moreover, it gives artists the essential tools and freedom to explore new dimensions of creativity and gain broader exposure. Author\nPrevious Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Art",
      "Top Stories"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/22/minting-music-on-base-sounds-new-blockchain-frontier/",
    "title": "Minting Music on BASE: Sound’s New Blockchain Frontier",
    "time": "December 22, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nMusic\nFeatures, Music\nMinting Music on BASE: Sound’s New Blockchain Frontier\nBy Gabrielle Rodriguez December 22, 2023\nIn the ever-evolving landscape of the music industry, artists constantly seek innovative ways to share and monetize their creations. A partnership between Sound and BASE, an Ethereum layer 2 platform developed by Coinbase, presents an opportunity for artists looking to create music with blockchain technology. Empowering Artists with Minting on BASE Artists using Sound now have the option to mint their music on BASE, providing a gateway to the Coinbase blockchain ecosystem. With reduced gas fees and faster transactions, BASE’s goal is to onboard the next billion users into the world of blockchain. Helping with this lofty goal, BASE enables artists to upload and withdraw their music for free and without bridging processes or the need to purchase crypto. On Sound, artists will have the power to decide the deployment platform for their contracts, with BASE, Optimism, and mainnet Ethereum as available choices. Sound covers all associated gas fees for uploads, revenue splits, and post-sales withdrawals. Bringing the next billion people onchain (through music). Base 🤝 Sound. From today you can mint music and collect on @buildonbase, paving the way for Sound to reach a mass audience of music fans. Collect the first track on Base featuring Reo Cragun and Heno to celebrate! ↓ pic.twitter.com/oZrE0K7BWZ — sound.xyz (🎧,🎧) (@soundxyz_) December 19, 2023 A Bridge to the Future of Music Integrating with BASE holds the potential to attract a big new audience in the coming years. With over 100 million users and $130 billion in capital on Coinbase, BASE eyes becoming a game-changer in the music industry. This user base is expected to drive increased attention to emerging music artists in Web3 on Sound. By offering a more user-friendly experience and reducing barriers to entry. Source Sound Transactions and Collectible Opportunities For collectors, purchasing songs on BASE involves bridging ETH to the platform. Whether through the official BASE bridge or using a credit card or mainnet ETH, collectors can acquire songs delivered on the BASE chain. Additionally, to mark the launch of this collaboration, BASE is releasing its first-ever song produced by Reo Cragun and Heno, titled “Based.” This track is available as a free open edition collectible on a special Base profile on Sound, offering a unique opportunity for collectors to engage with exclusive content. The integration of Sound and BASE represents an exciting development in the music industry, bringing together the power of blockchain technology and the creative talents of artists. With a focus on user-friendly experiences, this collaboration hopes to open new doors for musicians and fans. Author\nPrevious Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Music",
      "Features"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/21/really-and-avalanche-pioneering-blockchain-based-ar-movie-experiences/",
    "title": "Really and Avalanche: Pioneering Blockchain-based AR Movie Experiences",
    "time": "December 21, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nWeb3\nTop Stories, web3\nReally and Avalanche: Pioneering Blockchain-based AR Movie Experiences\nBy Gabrielle Rodriguez December 21, 2023\nReally, a company known for providing Web3 and Augmented Reality (AR) interactive experiences around blockbuster movies, has joined hands with the Avalanche blockchain platform. The partnership aims to recast digital collectible ticketing experiences by utilizing a layer-2 Ethereum scaler. Digital IDs and Global Expansion This collaboration will see Fandime NFT holders get a unique, blockchain-based digital ID. This ID will be minted on the Avalanche blockchain and stored securely in their Really account. Really’s expansion into several Asian and Oceanic regions, including Japan, Korea, Australia, the Philippines, Thailand, Malaysia, and Singapore, is expected to significantly enhance the digital collectible movie experience globally. Engaging Fans with Fandime Tokens The innovative Fandime tokens serve as a new form of audience engagement. Fans can earn these tokens by attending movies, buying merchandise, and interacting with Really’s AR experiences. Additionally, these tokens can be purchased directly on the Fandime app. Once earned or purchased, Fandime tokens open doors to a host of perks. These include digital rewards, movie-related AR content, exclusive opportunities, AR trophies, and wearable face filters. Token holders can immerse themselves into a unique digital universe brought to life through AR and blockchain technology. Future of Fandime Tokens Speaking about the partnership, James Andrew Felts, the CEO of Really, emphasized the groundbreaking fusion of AR and blockchain technology. He noted the significant transition from 2D to 3D digital interfaces, and how it has personalized digital interactions. Fandime tokens’ utility is set to expand in the coming year. Really plans to introduce more ways to earn and redeem these tokens. These include purchasing movie tickets and merchandise, availing discounts, and earning tokens for viewing content at home. A New Era in Entertainment This partnership is poised to redefine the entertainment industry, bridging the gap between the physical and digital worlds. With a focus on personalization and interactivity, the collaboration between Really and Avalanche is a giant leap forward for both blockchain technology and the movie industry. The blend of AR and blockchain technology offers a new dimension to the cinematic experience, making it more immersive and engaging than ever before. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Web3",
      "web3",
      "Top Stories"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/11/22/gam3-awards-returns-to-celebrate-web3-gaming-shortlisted-final-nominees-revealed/",
    "title": "GAM3 Awards Returns to Celebrate Web3 Gaming; Shortlisted Final Nominees Revealed",
    "time": "November 22, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nGaming\nGaming, Press Release\nGAM3 Awards Returns to Celebrate Web3 Gaming; Shortlisted Final Nominees Revealed\nBy Press Release November 22, 2023\nWeb3 gaming awards return bigger \u0026 better presented by GAM3S.GG \u0026 Magic Eden with $2M in Prizes \u0026 $100k Community Rewards; voting starts today The final shortlist of games for the GAM3 Awards 2023 are finally in! The biggest web3 gaming event returns on 14 December 2023 for the second year with games going head to head for bragging rights and a prize pool of over $2M, to set the scene for 2024. GAM3S.GG are bringing back the “oscars of web3 gaming” presented in partnership with Magic Eden this year, as 70+ traditional and web3 gaming experts come together to decide the leading games in this space; with the event sponsored by AD Gaming. Initially, 214 nominated games were put in front of 70+ jury members to help produce the preliminary list of nominees. Based on gameplay, mechanics, replayability potential, “fun” factor, accessibility and overall quality – 40 shortlisted games have made it onto the next round which opens up for community voting today, November the 22nd. In comparison, the 2022 awards saw 106 nominees in its inaugural edition, with the number of qualified games with playable versions more than doubled – reflecting the tremendous growth of web3 gaming throughout the past year. The 40 shortlisted games spanned 9 blockchain networks, with Arbitrum making an awards debut this year with 4 shortlisted finalists. The top five networks represented in the final shortlists are Polygon, Ethereum, Immutable X, Arbitrum and Avalanche. Bringing together industry leaders from both traditional and blockchain gaming allows the awards to maintain a balanced sense of expectation, caution and excitement. This year the jury consists of executives and leaders from Amazon, Google, Ubisoft, Microsoft, and Samsung, in addition to web3 gaming ecosystems, VCs, media outlets and content creators. This year’s prize pool for the winning games exceeds $2M+ and ranges from cash grants, tech service credits, marketing support, sponsored tournaments, infrastructure support, cloud gaming functionality, and much more from a wide range of partners including Amazon, Magic Eden, AD Gaming, Ultra, Blockchain Gaming Alliance, Naavik, Aethir, and Horizon among others. The 40 finalists are advancing to the second phase of the GAM3 Awards, where the decision-making process involves both jury members and public voting. In this phase, the jury’s votes has a 90% influence, while community votes will account for the remaining 10%, effectively giving the public a role akin to having 7 seats on the jury in terms of impact, which could very well act as a tiebreaker or shift the balance in favor of some finalists over others. However, for specific categories such as the ‘People’s Choice Award’ and ‘Best Content Creator’, the outcome relies solely on community votes. Both categories have already amassed over 50K nominations, giving the spotlight to 500+ games and 300+ creators from all over the world as fan favorites. Additionally, the ‘Games’ Choice Award’ is determined by shortlisted game studios voting for what is essentially, their own version of game of the year. This year, several games stood out to the jury as Big Time, Wildcard, Parallel and Deadrop shared the highest number of nominations with 5 each; followed by Illuvium and MetalCore with 4 nominations each. The final GAM3 Awards livestreamed ceremony is scheduled for December 14th, 2023 to be hosted on Twitch, YouTube and X among other streaming platforms; with gameplay premiers and exclusive premieres trailers already confirmed from Star Atlas, The Unioverse, among other titles. Last year’s event saw the first public premieres and exclusive footage from several games including Mythic Protocol Riftstorm, Mighty Action Heroes, and NFL Rivals – which has since amassed over 3M+ downloads on their mobile game. Lastly, the event is also set to reward community members, voters and viewers for their participation. Magic Eden is set to host an exclusive free mint for voters which provides early access to future mints, gaming raffles and exclusive quests. In addition, community voters and viewers have an opportunity to win rewards from a prize pool worth over $100k USD in prizes ranging from in-game items, early access passes, gaming PCs, gaming consoles and accessories. The Game of the Year final nominees are: Parallel Big Time Deadrop Wildcard NFL Rivals For the full list of nominees, visit gam3awards.com. Final voting starts November 22nd and runs until December 1st, directly on GAM3S.GG’s platform on the GAM3 Awards page. Stay tuned for exclusive content, jury interviews, finalist announcements, and more ahead of the December 14 ceremony. For more information, please visit: gam3awards.com. —————————– About GAM3 Awards GAM3 Awards is the industry’s leading web3 gaming awards. The event, first launched in 2022 and presented by GAM3S.GG, celebrates the highest quality web3 games, rewarding innovation and creativity at the intersection of blockchain and consumer entertainment. Back for its second year with new partners such as Magic Eden, Amazon and Google, the GAM3 Awards will reward the top games developers with monetary prizes and services valued at over $2M. Learn more: https://gam3s.gg/gam3awards/ About Magic Eden Magic Eden is the leading cross-chain NFT platform, building a user-friendly platform for minting and collecting NFTs. Magic Eden brings dynamic cultural moments onto the blockchain, empowering users across thousands of digital communities to create, discover and collect unique NFTs. To date, the platform has facilitated over $3 billion in transactional volume. For more information, please visit magiceden.io. —————————— Quotes for PR: To highlight the increasing standard in web3 games compared to previous years. George Yousling, Director of Business Development at Polygon Labs states: “Despite the macro headwinds, I’m encouraged by high quality games reaching open beta and early access. Games that are fun to play with fleshed out core loops, tutorials, in-game economies, and progression systems. User flows that remove friction through account abstraction and help get players enjoying the experience upfront as opposed to clunky onboarding.” Moreover, prominent names within web3 gaming, such as Robby Yung, CEO of Animoca Brands, shared their thoughts on how the past year has contributed to the overall positive direction in the quality of games in web3. Robby told us in an exclusive interview: “2023 is going to be remembered as a milestone year, on the one hand because the economic downturn meant that only the most dedicated developers continued building, but on the other hand, because the kinds of games that we’re seeing launch now are far more polished than the first generation of web3 games.” Looking at the future of web3 gaming in 2024, Chris Akhavan, Chief Gaming Officer at Magic Eden added: “We are thrilled to see over 200 web3 games nominated for the GAM3 Awards. Can’t wait to see who the winners will be on December 14th, and in the meantime, we all have a lot of playing to do!” —————————— Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Press Release",
      "Gaming"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/11/20/van-gogh-artworks-minted-as-nfts-sell-for-over-2-5-million/",
    "title": "Van Gogh Artworks Minted as NFTs Sell for Over $2.5 Million",
    "time": "November 20, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nArt\nArt, Featured\nVan Gogh Artworks Minted as NFTs Sell for Over $2.5 Million\nBy Mia Patel November 20, 2023\nTwo pieces of artwork inspired by Vincent van Gogh’s work have commanded significant attention in the crypto market. These pieces, converted into digital format and tokenized, have fetched more than $2.5 million. One particular NFT inspired by a Van Gogh painting was sold for $1.3 million, whereas the second one fetched consecutive $1.27 million at an auction. The digitized artworks, identified as numbers 132 and 283, attracted heavy interest. The size of the winning bids was 35.9999 BTC and 34.9999 BTC on the Bitcoin network respectively. This signifies a recent surge in buyers, on the edges of a wider trend that sees NFTs themed after Vincent van Gogh become highly sought-after commodities in the market. The Musée d’Orsay’s NFT Initiative In response to the growing interest in Van Gogh-inspired NFTs, Paris’ Musée d’Orsay announced plans to conceive unique NFTs inspired by the Dutch post-impressionist painter’s works. These NFTs will be minted on the Tezos blockchain and will come in two primary forms: an augmented reality experience and a digital art piece conceptualized by French artist KERU. Looking ahead to the future, from 2024, Musée d’Orsay openly plans to invite digital artists to exploit the blockchain technology. This is aimed at encouraging the creation of collections inspired by the museum’s permanent exhibits. Market Dynamics Significantly, this recent surge in sales comes after a period of notable downturn in the NFT market, prompting some observers to argue that there is a revival currently taking place. The high sales have also indicated that NFT collections on the Bitcoin network are starting to achieve considerably more than those on the Ethereum network. This could mark a potential shift in the platform preferences of digital artists and collectors alike. The allure of Van Gogh, paired with the innovative potential of NFT technology, may just be the catalyst for further growth and evolution of the digital art world. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Art",
      "Featured"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/04/25/animoca-brands-subsidiary-tinytap-raises-us8-5-million-to-disrupt-education-with-web3/",
    "title": "Animoca Brands’ subsidiary TinyTap raises US$8.5 million to disrupt education with Web3",
    "time": "April 25, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nEducation, Web3\nPress Release\nAnimoca Brands’ subsidiary TinyTap raises US$8.5 million to disrupt education with Web3\nBy Press Release April 25, 2023\n25 April 2023 – TinyTap, a subsidiary of Animoca Brands and the leading edtech platform for user-generated educational games, today announced that it has raised US$8.5 million from investors including Sequoia China, Liberty City Ventures, Kingsway Capital, Shima Capital, Polygon, GameFi Ventures, and others. The funding will be used to support TinyTap’s business expansion and accelerate development in the edtech space. The investment will enable TinyTap to continue to expand its successful Web2 platform, which already serves over 9.2 million registered members, into an alternative Web3 education system that better values teachers by improving the earning opportunities available to them, and enables parents and communities to support and promote their preferred educational materials. TinyTap launched its Web3 strategy in 2022 with two successful auctions of Publisher NFTs, which generated 243 ETH (approximately US$352,000 at times of auction). Publisher NFTs are a new concept introduced by TinyTap to better empower, reward, and incentivize educational content creators and publishers. Each Publisher NFT represents co-publishing rights to one TinyTap Course, which is a curated bundle of educational games made on the TinyTap platform by one teacher in one specific subject. When these NFTs are sold, the proceeds are shared with the Course creators, and the NFT buyers assume the role of co-publishers. In return for promoting and marketing the associated Courses, the buyers share in the benefits generated from co-publishing efforts. Since the TinyTap Publisher NFTs were auctioned in Q4 2022, the average income to NFT buyers resulting from their co-publishing efforts amounted to approximately 8.2% (or 19.7% annualized) of the purchase price of the Publisher NFTs*. The Publisher NFT model is therefore able to simultaneously benefit the creators of educational content, the buyers of the Publisher NFTs, and TinyTap. This frees the creators to focus their efforts on generation of quality content, while TinyTap and the buyers of Publisher NFTs distribute and promote the content. Misa Matsuzaki owns two Publisher NFTs and earned about $7,823 from November 2022 to March 2024 by co-publishing the associated courses. She commented: “TinyTap helps teachers to actualize great ideas into educational content that can be accessed regardless of location – for example, one of the courses I bought was adapted for Japan. I did the first translation and voice over myself with the help of the TinyTap team. I look forward to seeing how Japan will welcome these exciting new possibilities in education! I would like to see more use cases like TinyTap Publisher NFTs, which are so much more interesting than just having NFTs sitting in our wallet!“ Yogev Shelly, CEO of TinyTap, commented: “Our Publisher NFTs genesis auctions demonstrated that the Web3 community is well suited and willing to support educators and educational content via this new powerful and equitable incentive system. By pairing educational content creators with interested promoters, we are able to benefit all parties fairly and take a significant step in our goal to put the power of learning back in the hands of educators, students, and the community.” Yat Siu, co-founder and executive chairman of Animoca Brands, commented: “Teachers and educators are among the most important content creators and contributors in society, and yet their wages typically do not reflect their critical importance. This is why we’re incredibly excited at the Web3 opportunities that TinyTap is exploring in the field of education. Having already succeeded in building a Web2 education platform, TinyTap is now supercharging its efforts using NFTs, making it possible for educators to better generate equity from their work and link up with co-publishers who can handle the promotion of their courses, all while offering students enhanced learning materials.” Follow TinyTap on Twitter to keep updated on future developments or visit the Web3 landing page to learn more. * Based on the courses’ earnings from the time the associated NFTs were purchased; does not take into consideration seasonal variations in the courses’ performance. Calculation represents an average of 5 months income of the co-publishers for 12 courses. For ease of comparison, earnings for courses that were purchased in December 2022 have been normalized to 5 months. About TinyTap TinyTap, a subsidiary of Animoca Brands, was founded in 2012 and is the world’s largest educational games library with more than 250,000 activities made by educators and publishers including Sesame Street and Oxford University Press. Games are created using TinyTap’s code-free authoring platform and can be accessed by parents as part of TinyTap’s subscription or sold directly to families as bundles. A portion of subscription revenue is shared with content creators based on the user engagement generated by their content. TinyTap is among the top 10 grossing kids apps worldwide, delivering educational content to families in the US, Canada, Europe, and the Arab world with a focus on young learners (Pre-K to Grade 6), serving 9.2 million registered family members with content created by over 100,000 creators. Learn more at https://www.tinytap.com. About Animoca Brands Animoca Brands, a Deloitte Tech Fast winner, a Fortune Crypto 40 company, and one of the Financial Times’ High Growth Companies Asia-Pacific 2023, is a leader in digital entertainment, blockchain, and gamification that is working to advance digital property rights and contribute to the establishment of the open metaverse. The company develops and publishes a broad portfolio of products including original games such as The Sandbox, Phantom Galaxies, Life Beyond, Crazy Kings, and Crazy Defense Heroes, and products utilizing popular intellectual properties including Disney, WWE, Snoop Dogg, The Walking Dead, Power Rangers, MotoGP™, and Formula E. It has multiple subsidiaries, including The Sandbox, Blowfish Studios, Quidd, GAMEE, nWay, Pixowl, Forj, Lympo, Animoca Brands Japan, Grease Monkey Games, Eden Games, Life Beyond Studios, Notre Game, TinyTap, Be Media, PIXELYNX, and WePlay Media. Animoca Brands has a growing portfolio of more than 380 Web3 investments, including Colossal, Axie Infinity, OpenSea, Dapper Labs (NBA Top Shot), Yield Guild Games, Harmony, Alien Worlds, Star Atlas, and others. For more information visit www.animocabrands.com or follow on Twitter or Facebook. Contact: press@animocabrands.com Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Education",
      "Web3",
      "Press Release"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/21/china-paves-the-way-for-web3-development/",
    "title": "China Paves the Way for Web3 Development",
    "time": "December 21, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nWeb3\nTop Stories, web3\nChina Paves the Way for Web3 Development\nBy Ethan Lee December 21, 2023\nIn an ambitious move, China has shown a heightened interest in fostering the growth and adoption of Web3 services within the nation. The Ministry of Industry and Information Technology (MIIT) has unveiled plans to build a framework. This framework aims to bolster the growth of non-fungible tokens (NFTs) and decentralized applications (dApps). The primary focus of this new framework encompasses government affairs and industry. The goal is to usher in novel business models like NFTs and dApps. Through this, the MIIT seeks to accelerate the application of Web3. It also aims to facilitate the growth of a vibrant digital ecosystem within the country. Key Policy Documents and Partnerships The MIIT has teamed up with the Cyberspace Administration of China. Together, they have issued key policy documents, such as the “Guiding Opinions on Accelerating Blockchain Technology Application and Industrial Development” and the “Regulations on Blockchain Information Services.” In partnership with the National Standardization Committee, the MIIT has also formed the National Blockchain and Distributed Accounting Technology Standardization Technical Committee (TC590). This committee will work on standardizing and promoting blockchain technology in the realm of Web 3.0 development. Source: Depositphotos A Tailored Strategy for China’s Needs China’s strategic approach involves conducting pointed research to address specific domestic needs. It aims to map the development path while tackling innovation and legacy problems. This strategy seeks to enhance technical research and oversight. It also encourages international collaboration to improve the visibility and application of Web3 technologies. In tandem with these strategic developments, China is also piloting RealDID, a digital identity service. RealDID seeks to strike a balance between user anonymity and real-name verification. It caters to the growing needs of the digital economy, underpinning China’s vision for a digitally-enabled future. This concerted effort is geared towards harnessing Web3 technology for national growth. It positions China as a key player in the nascent industry. Conclusion China’s forward-thinking approach and strategic adoption of Web3 technologies demonstrate its commitment to harnessing the potential of this emerging digital landscape. The nation’s customized strategy, coupled with the implementation of key policies and partnerships, showcases its intent to become a prominent figure in the global Web3 industry. The pilot project RealDID underlines this commitment, highlighting China’s efforts to balance digital innovation with user-centric design. As China continues to navigate this digital transformation, the world watches with interest, recognizing the potential ripple effects across the global technology and economic landscape. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Web3",
      "web3",
      "Top Stories"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/11/30/building-bridges-with-crypto-homosapiens-art-and-investment-in-the-digital-age/",
    "title": "Building Bridges with Crypto Homosapiens: Art and Investment in the Digital Age",
    "time": "November 30, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nWeb3\nPress Release, web3\nBuilding Bridges with Crypto Homosapiens: Art and Investment in the Digital Age\nBy Jayden Smith November 30, 2023\nBuilding bridges between disparate worlds often leads to innovative breakthroughs. For instance, the merge between cryptography and the principles of sound money enabled Satoshi Nakamoto to engineer Bitcoin as the world’s first cryptocurrency. In like manner, the NFT space bridged the gap between digital art and blockchain technology, creating a unique platform for artists and collectors to thrive. And Crypto Homosapiens (CHS) is all about – using NFTs with a powerful narrative to spark interest in NFT art trading among the masses. Here are a few ways CHS is simplifying NFT art and investment and what that means for the future of NFTs. Enhancing Accessibility and Educational Resources Crypto Homosapiens (CHS) is revolutionizing the NFT market by making it more inclusive and user-friendly. The platform is designed to be approachable for newcomers, emphasizing a community-driven experience that educates and engages its users about NFTs and blockchain technology. Ugh! Tribe grow big! 10,000 Crypto Homosapiens here! – Some common like stone – Some rare like good spear – Some epic like big hunt – Some legendary like fire discovery – Few ultra legendary like star in sky Plus, secret tier… shhh! More rare, more shiny future! pic.twitter.com/kvUnnB6agH — Crypto Homosapiens (@HomosapiensAPC) November 21, 2023 Its intuitive user interface provides a wealth of educational resources, including FAQs, video tutorials, and live support, to further enhance understanding and participation in the NFT community. By combining these elements, CHS creates a perfect environment for trading digital art as well as learning and growing together in a supportive community. This inclusive and educational approach ensures that NFT trading is accessible to a wide audience, breaking down barriers to entry in the digital art world. Collaborations with Communities Another strategy that CHS is deploying to bridge the digital divide is through collaborations with a series of engaging and interactive actions such as completing quests for rewards, meta rooms, mini-games, social interaction with the community and so on. The quests are designed to be both entertaining and educational, providing users with opportunities to earn rewards while engaging with the platform. The platform takes community engagement a step further by enabling NFT holders to join meta rooms where community members can interact, display their NFTs, or simply take part in virtual gatherings. CHS also enhances user experience by introducing mini-games within the platform. Beyond entertainment, these games serve as a novel way to interact with NFTs and the broader CHS community. They provide a fun and interactive way to learn about digital art and blockchain technology. Me an Akkadian. Part of tribe. We hunt, we share, we make stories. You come, see how we live? pic.twitter.com/t0hKo2ueEZ — Crypto Homosapiens (@HomosapiensAPC) November 29, 2023 A Flourishing NFT Ecosystem with Diverse and Affordable Artworks Crypto Homosapiens caters to a diverse audience by offering a wide range of NFTs at various price points. This inclusivity ensures that NFTs are accessible to all. The platform categorizes its offerings into Common, Rare, Epic, Legendary, and Super Legendary NFTs, facilitating community bonding over shared interests and values. It stands out as a community that champions both financial independence and creative expression. By focusing on education, simplifying user experience, and leveraging collaborations and social interactions, CHS is poised to significantly reduce the digital gap in NFT art trading. This innovative approach promises to introduce NFTs to a wider audience and foster a diverse, inclusive, and sustainable ecosystem for NFT creators and collectors. In this digital age, CHS is a revolutionary platform for both investors and artists; it’s a community where art and investment harmoniously coexist. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Web3",
      "web3",
      "Press Release"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/19/improbable-strikes-97-million-deal-to-sell-the-multiplayer-group/",
    "title": "Improbable Strikes $97 Million Deal to Sell The Multiplayer Group",
    "time": "December 19, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nMetaverse\nmetaverse\nImprobable Strikes $97 Million Deal to Sell The Multiplayer Group\nBy Isaac Chang December 19, 2023\nImprobable, known for its metaverse technology innovations, announced the sale of its gaming division, The Multiplayer Group (MPG), to Keywords Studios for £76.5 million ($97.1 million). This move enhances Keywords Studios‘ ‘Create’ division by incorporating MPG’s extensive expertise in multiplayer game development. MPG has collaborated with eminent gaming studios and publishers, including Activision Blizzard, Bethesda, Epic, and 2K. Growth and Leadership Born in 2018, MPG has witnessed significant growth, with a worldwide workforce that now extends to over 360 employees. Even post-acquisition, the leadership team, consisting of Andy Norman, Rocco Loscalzo, Vaughan O’Brien, and Roger Cheung, will continue to steer MPG. Their guidance should prove crucial in meeting the growth objectives envisioned for the forthcoming two years, guided by a management incentive plan. Bertrand Bodson, CEO of Keywords Studios, stated: “We are thrilled to welcome the MPG team to Keywords. MPG is a business that we have long admired for its high-quality work, blue-chip client base, deep experience in developing AAA multiplayer games and its use of technology and data analytics. This acquisition marks a significant step in our strategy to enhance our platform and broaden our services, specifically in the realm of specialized multiplayer game development on a large scale, an area witnessing growing demand in the realm of live services.” As Keywords Studios broadens its reach, Improbable redirects its focus towards the flourishing realm of metaverse development. The firm intends to scale its experimental metaverse events to expand its present capacity. Digital Revolution: Metaverse and Web3 In their recent annual report, Improbable emphasizes the current relevance of the metaverse and Web3 technologies. The company foresees a shift in gaming that will phase out the boundaries between physical and digital realities. Herman Narula, Improbable’s co-founder and CEO, remarked, “The metaverse is poised for growth in 2024, fueled by the convergence of gaming, VR/XR, and web3 technologies. Headsets like Apple’s Vision Pro and the success of Meta Quest 3 will further ignite demand for immersive metaverse experiences. Gaming companies will integrate metaversal elements into their offerings, creating new brand activation opportunities. Consolidation in the gaming and web3 sectors will lead to a stronger, more innovative, and more resilient startup ecosystem, with companies pooling resources and expertise to develop groundbreaking metaverse applications.” Web3 ecosystem development is on the horizon, bringing a scale of maturity and stability unseen in earlier phases. Asia is deemed to emerge as a significant participant, shaping the future across this digital frontier. It is predicted to act as the hub for online communities, digital asset economies, and digital events – a testament to the vital nature of the rapidly evolving technology landscape. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "metaverse",
      "Metaverse"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/11/22/tragedy-khadafi-assumes-role-as-chief-hip-hop-officer-at-infanity/",
    "title": "Tragedy Khadafi Assumes Role as Chief Hip Hop Officer at Infanity",
    "time": "November 22, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nMusic\nMusic, Top Stories\nTragedy Khadafi Assumes Role as Chief Hip Hop Officer at Infanity\nBy Isaac Chang November 22, 2023\nInfanity has appointed Tragedy Khadafi, the esteemed recording artist and hip-hop mastermind, as its Chief Hip Hop Officer. The role will see Khadafi managing cultural content development and legacy building for the platform. Infanity maintains a distinctive position in the music industry. It seeks to empower independent artists to steer their musical journeys. By leveraging Web3 technology, the platform allows artists to release their music independently and offer unique experiences that broaden their fan bases. Press conference of Tragedy Khadafi accepting the Executive position of CHIEF HIP-HOP OFFICER of Infanity https://t.co/8BOgj8tcJL pic.twitter.com/03eBCWbRub — Infanity (@Infanity) November 17, 2023 Fusing Traditional Hip-Hop with Web3 Infanity and Tragedy Khadafi’s alliance aims to unite the worlds of traditional hip-hop and the progressive Web3. Renata Lowenbraun, Infanity’s CEO, conveyed her excitement in welcoming a figure as significant as Tragedy Khadafi onto their team. Lowenbraun singled out Khadafi’s perspective and guidance as catalysts in moulding the fate of hip-hop artists venturing into Web3. Known also as Intelligent Hoodlum, Tragedy Khadafi has been an influential force within the hip-hop community. As the youngest member of the Queensbridge pioneers, Khadafi was instrumental in mentoring and launching Capone-N-Noreaga’s platinum-selling album, “The War Report,” through his label, 25 to Life Entertainment. He has also released records with esteemed labels like A\u0026M Records, V2 Records, and Caroline Distribution/EMI. Music NFTs: Powering a New Era in The Music Industry Music NFTs introduce numerous possibilities for artists and their fans. They act as a powerful vehicle, allowing artists to release new music directly to their fan base, bypassing conventional record labels or streaming platforms. On the other hand, fans can back their favorite artists by purchasing virtual items such as concert tickets, merchandise, or even a piece of the artist’s future success. NFTs also offer an avenue for artists to raise funds for fresh projects or causes close to their hearts. One of the most transformative aspects of music NFTs is their ability to cultivate more rewarding, creative, and intimate communities for artists and fans. This fresh approach democratises the music industry by allowing fans to share ownership of songs and have a tangible stake in an artist’s success. This shift promises a more interactive relationship between artists and fans, potentially reshaping music production and consumption. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Music",
      "Top Stories"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/20/metaplex-launches-new-standard-for-on-chain-assets-on-solana-blockchain/",
    "title": "Metaplex Launches New Standard for On-Chain Assets on Solana Blockchain",
    "time": "December 20, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nWeb3\nFeatures, web3\nMetaplex Launches New Standard for On-Chain Assets on Solana Blockchain\nBy Mia Patel December 20, 2023\nMetaplex, the reputable Web3 firm renowned for developing an extensive open-source protocol and toolset, has launched Metaplex Inscriptions and Engravings. This new standard is designed for on-chain and immutable digital assets on the Solana blockchain. NFT Creation and Storage Metaplex is widely recognized for its fast and affordable NFT ecosystem. The platform comprises four smart contracts, including Token Metadata, Token Vault, Auction, and Metaplex. Designed to enable developers, creators, and artists to create, launch, and trade NFTs on Solana, these contracts have proven critical tools in various domains like digital art, gaming, and collectibles. One of the most exciting aspects of Metaplex is its ability to enable creators to build communities through branded storefronts. However, until now, the platform has relied on external storage solutions like Arweave, IPFS, and S3 to manage the metadata and media behind its NFTs. This reliance on external storage solutions is slowly becoming a thing of the past as Metaplex introduces its Inscriptions, which allows on-chain storage of metadata and media. Enhancing Security and Trust The platform’s latest standard also introduces Engravings, a key feature that brings true immutability to Solana’s NFTs. In the past, Solana’s NFT marketplace faced issues related to alterations, rendering the network’s famous low fees and fast transaction times a liability for maintaining a secure marketplace. However, with the introduction of Engravings, changes to Engraved NFTs are impossible, ensuring the NFT’s ultimate security. The benefits of Metaplex’s new standard are clear. Creators can now enjoy the advantages of decentralized on-chain storage for NFT metadata and media with increased autonomy and security. Furthermore, the platform introduces a new level of trust in the market, making NFT’s accessible to a massive audience. Conclusion The crypto market is constantly evolving, showcasing new and exciting opportunities for investors and enthusiasts alike. Metaplex’s latest standard, Inscriptions, and Engravings represents one such opportunity. By enabling on-chain storage and immutability of NFTs, Metaplex is set to transform the NFT market on Solana and beyond. This innovation will pave the way for new and creative use cases and emerging artists, thus gaining increased adoption in the broader crypto community. With Metaplex continuing to be a leader in NFT technology, it is evident that the crypto market can expect to see many more groundbreaking innovations in the future. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Web3",
      "web3",
      "Features"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/22/animoca-brands-embraces-interoperability-in-gaming/",
    "title": "Animoca Brands Embraces Interoperability in Gaming",
    "time": "December 22, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nGaming\nFeatured, Gaming\nAnimoca Brands Embraces Interoperability in Gaming\nBy Mia Patel December 22, 2023\nAnimoca Brands, led by CEO Robby Yung, is setting a new standard in the world of Web3 gaming. Speaking at an NFTUK event in London, Yung touched on the transformative potential of interoperability in this space and its power to attract new players. Web3 Gaming: The New Arena According to Yung, Web3 games, unlike their predecessors, allow for the seamless sharing of digital assets in the form of NFTs across various platforms. This interoperability could potentially draw players from well-known games to newer ones, in a strategy likened to “vampiric attacks” seen in decentralized finance (DeFi). However, instead of draining resources, Yung views the phenomenon as capable of creating a virtuous cycle. Furthermore, Yung noted that interoperability could serve as a gateway for players and creators alike. The shared utility of NFTs enhances the value of in-game assets. Game creators may also earn royalties from these shared assets, contributing to a collaborative and prosperous gaming ecosystem. Achieving interoperability is no easy task. It demands intensive collaboration among game developers and initiatives such as the Open Metaverse Alliance. Animoca Brands wholeheartedly endorses this collaborative approach. Simplifying Web3 for Mainstream Gamers One of the primary objectives for Animoca Brands is to integrate mainstream gamers into the Web3 ecosystem. This integration involves simplifying certain Web3 aspects, like public ledger registration of digital assets and maintaining off-chain game logic for cost-efficiency. With the advancement of Web3 middleware, traditional game developers now have the capability to integrate Web3 features such as custodial wallets and minting solutions, without requiring extensive blockchain knowledge. Seamless, user-friendly Web3 games are making their mark, signaling a shift from traditional gaming practices. However, the transition from Web2 to Web3 systems poses a significant challenge, especially for gamers accustomed to older practices. Custodial wallet solutions can play a central role in this transition, easing the learning curve for new users. In conclusion, Animoca Brands, under the leadership of Robby Yung, is poised to spearhead the evolution of gaming. Interoperability holds the key to a more vibrant, dynamic, and inclusive gaming community. Author\nPrevious Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Minting Music on BASE: Sound’s New Blockchain Frontier Gabrielle Rodriguez December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Featured",
      "Gaming"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/19/looksrare-extends-zero-fee-policy-to-boost-holiday-trading-activity/",
    "title": "LooksRare Extends Zero-Fee Policy to Boost Holiday Trading Activity",
    "time": "December 19, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nCollectibles\nLooksRare Extends Zero-Fee Policy to Boost Holiday Trading Activity\nBy Gabrielle Rodriguez December 19, 2023\nLooksRare, a community-driven NFT marketplace, has recently announced that it’s extending its no-fee policy for another 30 days, coinciding with the Christmas holiday season. In this blog post, we’ll explore LooksRare’s initiative and how it impacts NFT collectors and investors. Zero-Fee Initiative LooksRare is a decentralized NFT marketplace built on the Ethereum blockchain. Since its launch early in 2022, LooksRare has become one of the most popular trading platforms in the NFT ecosystem. In November, LooksRare revised its fee structure, offering a temporary zero-fee policy on NFT sales that began on November 16 and remained in effect until December 16. As a result, NFT sellers received 100% of what they listed their NFTs for. You asked, and we delivered. Sell NFTs with zero fees on LooksRare is being extended for 30 days. You get back 100% of whatever value you list your NFTs at. No exceptions. Enjoy! pic.twitter.com/4BVy66znWi — LooksRare (@LooksRare) December 18, 2023 LooksRare’s recent announcement indicates that the zero-fee selling initiative will continue until mid-January, with the goal of attracting more sellers and increasing platform activity, especially during the festive season. This initiative provides an opportunity for sellers to maximize their profits without having to pay any transaction fees. It’s also a valuable opportunity for collectors to purchase NFTs at a discounted price, making the platform more accessible to trading enthusiasts and investors. Enhancing NFT Market Dynamics The zero-fee initiative is the result of the launch of LooksRare’s Version 2 upgrade and a shift to zero-royalty trading. These upgrades have contributed to LooksRare’s adaptability and responsiveness to the highly competitive NFT market environment. The initiative is expected to encourage more participation among NFT collectors, investors, and sellers, thus driving more activities on their platform. By extending the zero-fee policy until January, LooksRare has seized the opportunity to bank on Christmas holiday traffic and boost activities on its platform, which is also part of their strategic plan for growth. This initiative is expected to bring a steady flow of new buyers and sellers to the platform and increase the platform’s volume, liquidity, and user base. Conclusion The extension of LooksRare’s zero-fee policy on NFT sales is a strategic move that aligns with their central aim of becoming the go-to marketplace for NFT enthusiasts and investors. The initiative is expected to increase platform activities, volumes, and liquidity while providing NFT sellers with an opportunity to maximize their profits. The extension will also make the platform more accessible to new trading enthusiasts and buyers. It will be interesting to see how this initiative impacts the NFT market and how LooksRare will continue to evolve to succeed in the highly competitive NFT space. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Collectibles"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/22/yuga-labs-introduces-cryptopunks721-wrapper-to-facilitate-nft-trading/",
    "title": "Yuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading",
    "time": "December 22, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nCollectibles\ncollectibles, Features\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading\nBy Anthony Nguyen December 22, 2023\nYuga Labs is looking to streamline the process of trading CryptoPunks collectibles. The company has unveiled a new wrapper called the CryptoPunks721, aiming to simplify transactions involving these early-minted NFTs. Pre-2018 NFT Trading Issues CryptoPunks, initially minted in 2017 before the full-scale adoption of the ERC-721 standard in January 2018, are storied for being among the pioneers in the NFT space. However, their operational roots in a pre-development landscape create a challenge for modern digital marketplaces. Before these vintage NFTs can be traded, they need to undergo a process called “wrapping”. In essence, wrapping constitutes the creation of an equivalent token or clone in value, while the original token remains securely under the custody of a custodial body. Although this appears to be a relatively direct step, it corresponds with a series of transactions, leading to substantially high operational costs. Source: Depositphotos CryptoPunks721 Wrapper Recognizing these hurdles, Yuga Labs crafted the solution of the CryptoPunks721 wrapper. Functioning on a permissionless basis, it employs the smart contract PunksData from Larva Labs for on-chain metadata access. The concept of this new wrapper is to address the setbacks by permitting both the wrapping and unwrapping of C721 tokens within a single transaction, therefore dramatically reducing the associated gas fees. Last week, Yuga finalized a series of interconnected contracts that unlock new possibilities across our projects. They\u0027ll start simple, but they\u0027re designed to allow evolution over time. Introducing: Your Stash. 1/🧵 pic.twitter.com/lI5L0eapZQ — quit (👀,🦄) (@0xQuit) December 20, 2023 The result is a streamlined, cost-effective process for trading NFTs derived from the iconic CryptoPunks collection. By simplifying the operations required for the inclusion of these tokens on major platforms, Yuga Labs takes a significant step towards resolving NFT-related inefficiencies. Consequently, this strategy could create a more welcoming environment for participants new to the NFT trading scene, further solidifying the company’s role as a leading figure in this blossoming market. Looking Forward The CryptoPunks721 wrapper by Yuga Labs is yet another indication of how entities within the blockchain ecosystem are searching for innovative methods to improve the user experience. Facilitating the interaction between old and new standards, this move reinforces Yuga Labs’ commitment to making cryptographic collectibles more accessible and manageable for every potential enthusiast. The precedent set by Yuga Labs is set to evolve the mechanics of NFT trading and could potentially spark a wave of similar innovations aiming to optimize the intersection of emerging digital token standards. Author\nPrevious Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nAnimoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More Minting Music on BASE: Sound’s New Blockchain Frontier Gabrielle Rodriguez December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "collectibles",
      "Features",
      "Collectibles"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/18/oracle-red-bull-racing-introduces-champions-collection-2023-nfts/",
    "title": "Oracle Red Bull Racing Introduces Champions Collection 2023 NFTs",
    "time": "December 18, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nCollectibles\ncollectibles, Top Stories\nOracle Red Bull Racing Introduces Champions Collection 2023 NFTs\nBy Anthony Nguyen December 18, 2023\nOracle Red Bull Racing has introduced its new NFT series, titled the ‘Oracle Red Bull Racing Champions Collection 2023‘. This collection celebrates the team’s remarkable achievements in racing. Celebrating a Record-Breaking Season The digital collectibles pay tribute to Oracle Red Bull Racing’s record-breaking season, distinguished by the accumulation of the highest championship points in a single season, leading the highest number of laps, and securing a one \u0026 two individual driver finish. The NFTs are exclusively available on Sui, Oracle Red Bull Racing’s official blockchain partner. This collaboration showcases Sui’s capacity to deliver notable on-chain experiences. Fans have the opportunity – for a limited period – to mint these collectibles for free on Bybit. The website also acts as the official NFT marketplace partner for the race team. Automobilist’s Unique Artistry Each of these NFTs boasts unique artwork from Automobilist, a design studio recognized for its motorsport-inspired creations. Not only do the digital collectibles echo the thrill of racing, but they also mirror progressive technological experiences. In a significant stride towards user convenience, the collectibles can be claimed through a progressive Sui feature. This feature allows fans to experience Web3 integrations effortlessly using their social media credentials, thus eradicating the need for a digital wallet. One noteworthy aspect of minting these collectibles is that users will not be required to pay any gas fees, which further enhances the accessibility and convenience of this initiative. Web3 Fan Engagement Dan Mitchell, Senior Marketing Manager at Oracle Red Bull Racing, stresses the role of innovative fan engagement and salutes Web3 technologies such as NFTs in augmenting the overall fan experience. According to Mitchell, these developments signify a new chapter in the interplay between sports, fandom, and technology. In pursuit of continuous digital innovation, Oracle Red Bull Racing has announced a multi-year partnership with Mysten Labs earlier this year. The partnership is aimed at strengthening digital fan experiences and employing the Sui Layer 1 blockchain to that end. This initiative represents a strategic step in combining popular sports with the growing digital space, reflecting the evolution of fan engagement in the world of motorsports. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "collectibles",
      "Top Stories",
      "Collectibles"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/15/disclosure-unveils-1000-unique-ai-generated-nft-tracks-with-beatport/",
    "title": "Disclosure Unveils 1,000 Unique AI-Generated NFTs with Beatport",
    "time": "December 15, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nMusic\nMusic, Top Stories\nDisclosure Unveils 1,000 Unique AI-Generated NFTs with Beatport\nBy Gabrielle Rodriguez December 15, 2023\nWith their latest venture, grammy-nominated electronic music duo Disclosure is breaking new ground in the music industry. They have announced the release of 1,000 unique NFTs, each featuring an AI-generated version of their track “Simply Won’t Do” from the “Alchemy” album, which debuted in July 2023. Termed the Disclosure Bronze Editions, this NFT collection is available on Beatport’s NFT marketplace. In this innovative collaboration, AI serves as the guiding force in crafting multiple takes on the track. Furthermore, each version, true to Disclosure’s renowned sound, is marked by its own distinctive character and feel. Exclusive Ownership and Artistic Collaboration Priced at $20 each, these NFTs provide exclusive ownership of a unique track rendition and ensure that these versions will never be replicated or released elsewhere. Adding to their appeal, each NFT features exclusive artwork from collaboration with Studio Grotesk, a well-known German art collective. The NFTs utilize the innovative Bronze AI technology, a generative music engine that reimagines existing music compositions using artificial intelligence. This isn’t Disclosure’s first foray with Bronze AI; their previous collaboration celebrated the 10th anniversary of their debut album “Settle” with an endless mix created by the same technology. Exploring New Frontiers in Music Rising stars in electronic music, Disclosure, featuring Guy and Howard Lawrence, have amassed a global audience with their unique fusion of soulful vocals, rhythmic beats, and engaging soundscapes. Blending garage, house, and funk, their sound stands out, earning widespread praise and a dedicated fan base. Their musical journey began in Reigate, Surrey, where they experimented with music production and DJing, inspired by the diverse sounds of soul, funk, and disco. Having significantly influenced the electronic music scene since their emergence in the early 2010s and boasting three Grammy-nominated albums, Disclosure continues to push boundaries. Their latest initiative aims to redefine music production and distribution, blending AI technology with the evolving NFT market to offer their fans a unique and personalized music experience. Music NFTs NFTs in the music industry present advantages for both musicians and their followers. Artists can utilize NFTs for new revenue streams and deeper fan engagement, selling their music directly as NFTs and circumventing traditional music industry channels. On the other hand, fans gain a more personal connection with artists through owning a part of their work and enjoying exclusive perks like early music releases, private events, or special behind-the-scenes access. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Music",
      "Top Stories"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/19/supporting-the-creator-economy-the-sandboxs-move-for-nft-royalties/",
    "title": "Supporting the Creator Economy: The Sandbox’s Move for NFT Royalties",
    "time": "December 19, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nMetaverse\nmetaverse, Top Stories\nSupporting the Creator Economy: The Sandbox’s Move for NFT Royalties\nBy Gabrielle Rodriguez December 19, 2023\nNFT royalties are reshaping how creators benefit financially from their work, transitioning them from one-time sales to sustained earnings. The Sandbox has embraced this concept, innovating its marketplace to facilitate a fair and automatic redistribution of royalties. The Mechanics of NFT Royalties When an NFT is minted, creators set a royalty percentage, entitling them to a portion of the sales from any future resale of the NFT. This mechanism protects the creator’s intellectual property rights and ensures ongoing compensation. While some platforms have integrated royalty systems, others rely on optional royalty payments, and some don’t enforce royalties at all, leaving creators without any secondary market earnings. Source The Sandbox Implementing a Fair Royalty System at The Sandbox At The Sandbox, the philosophy revolves around supporting a global creator economy by redistributing a portion of secondary market royalties back to the original NFT creators. This approach aims to foster long-term monetization for creators’ works. The Sandbox team has developed an internal solution that automatically redirects part of the ASSET‘s secondary market royalties to the original creator’s wallet. Launched on December 14, 2023, this feature aims to ensure that creators benefit directly from secondary sales of their assets. Royalty Redistribution on The Sandbox Marketplace In The Sandbox, ‘ASSETs’ are voxel assets intended to add content to various experiences, including games developed on LANDs. Besides their functional use, ASSETs can be collected, monetized, and traded. Until now, The Sandbox has received a 5% royalty from secondary sales of ASSETs. With the upcoming feature, these royalties will be split equally between The Sandbox and the original NFT creator, each receiving 2.5%. This change automatically ensures that creators receive their fair share of secondary market sales. The mechanism will also be compatible with other marketplaces that adopt the ERC-2981 standard, with this accessibility planned for 2024, according to the Sandbox. Creators utilizing The Sandbox Marketplace can have confidence that secondary market royalties will be reliably enforced and directly deposited into their wallets. This development by The Sandbox represents another stride in ensuring fair compensation for creators in the NFT marketplace. By facilitating an automatic and equitable redistribution of royalties, The Sandbox sets a precedent for how platforms can support their creator communities in the evolving digital art and assets world. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "metaverse",
      "Metaverse",
      "Top Stories"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/20/immutable-ushers-in-new-era-with-passport-launch/",
    "title": "Immutable Ushers in New Era with ‘Passport’ Launch",
    "time": "December 20, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nGaming\nGaming, Top Stories\nImmutable Ushers in New Era with ‘Passport’ Launch\nBy Jayden Smith December 20, 2023\nImmutable, a leader in the blockchain gaming industry, has officially launched its Immutable Passport. This universal profile system aims to simplify the signup process for Web3 gamers and enable players to carry identity, achievements, and digital assets across multiple online games and marketplaces. Simplifying Signups and Onboarding Currently a complex and potentially off-putting process for gamers interested in trying Web3 games, Immutable Passport offers a simple and secure solution for game studios and marketplaces. Already integrated into five web3 games and marketplaces, including Gods Unchained, Blocklete Golf, Bleacher Report Watch2Earn, TokenTrove, and AtomicHub, Immutable Passport brings its benefits to a current user base exceeding 500,000 people. With Immutable Passport, each user receives a unique, secure identity, streamlining their entry into games and marketplaces and ensuring the continuity of their assets, funds, and achievements across platforms. In the works since it was announced last February, Immutable Passport also introduces passwordless sign-on and automated wallet creation. The Passport dashboard lets players discover new games, manage funds, link third-party wallets, organize in-game items, and increase security. It also has a Google or Apple login function. Source Immutable Case Studies show Promise Immutable case studies indicate that Passport users are more than twice as likely to complete the onboarding process compared to traditional email+wallet methods, making it a potential game-changer for developers seeking to attract and retain players. With the announcement, Robbie Ferguson, Immutable‘s President and Co-Founder, highlights a significant challenge in the Web3 gaming industry: user acquisition. “Ask any web3 game or marketplace about the biggest barrier to adoption, and they’ll talk about user acquisition.” He emphasizes the benefits of Immutable Passport for developers, stating, “It’s incredibly frustrating to spend countless hours building a superb game only to lose potential players because of a complex and cumbersome signup process. That’s why our developer partners love Immutable Passport. It increases user acquisition, optimizes transaction conversion rates, and gives players a smooth, seamless experience that enables them to explore new worlds and participate in new economies like never before.” Gods Unchained and Immutable Passport One highly successful game that has embraced Immutable Passport is Gods Unchained, a popular tactical trading card game. Boasting over $52 million in card exchanges, 450,000 registered players, and a strong presence in the web3 gaming sector, Gods Unchained is a prime example of the success achieved through Passport integration. As a special offer to commemorate Immutable Passport’s launch, Gods Unchained will provide players with a free NFT airdrop available until December 31st, according to the announcement. Immutable Passport represents a forward-thinking advancement in the Web3 gaming and marketplace landscape. By simplifying signups, providing a secure identity for each user, and ensuring easy access to games and marketplaces, Immutable Passport will hopefully set the stage for a more streamlined and enjoyable Web3 gaming experience. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Top Stories",
      "Gaming"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/08/31/tinytap-integrates-ai-and-nft-features-to-enhance-educational-content/",
    "title": "TinyTap Integrates AI and NFT Features to Enhance Educational Content",
    "time": "August 31, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nEducation\neducation, Top Stories\nTinyTap Integrates AI and NFT Features to Enhance Educational Content\nBy Seamus O Connor August 31, 2023\nIn a recent announcement, TinyTap, an ed-tech subsidiary of Animoca Brands, unveiled a set of new tools that incorporate Artificial Intelligence (AI) and Non-Fungible Tokens (NFTs) designed for educators and parents. These tools are part of the platform’s offerings aimed at facilitating the rapid development of educational games and content. Built on TinyTap’s rich dataset, which encompasses over 250,000 games and has seen more than 170 million plays, the new features promise to add a dynamic edge to educational material creation. AI-Enhanced Educational Game Development One of the primary features introduced is the AI-powered game generation tool, specifically designed to assist educators in swiftly creating games based on topic-specific prompts. Drawing from an expansive data pool accumulated over the past decade, these AI tools generate games that are both age-appropriate and educationally relevant. According to Yogev Shelly, CEO of TinyTap, the beta version of these tools currently focuses on single-topic prompts. However, there are plans for future iterations to understand and generate games based on complex, multi-faceted prompts. Incorporating NFTs to Add Value to Educational Content Scheduled to launch in the fourth quarter of the year, TinyTap is collaborating with Open Campus to offer an interesting crossover between NFTs and education. NFT and EDU token holders will have the ability to mint TinyTap games into NFTs. The objective of this integration is to add a new layer of liquidity to the education sector, providing educators with an expanded set of opportunities for content distribution and monetization. Confluence of AI, Blockchain, and Future Ed-Tech Trends Yat Siu, the co-founder and executive chairman of Animoca Brands, believes that AI and NFTs can play a significant role in shaping the future of educational technology. He states that the inclusion of these technologies into TinyTap’s platform marks a progression towards what he calls a “smart education system”. This emerging model of education could integrate other advanced technologies like blockchain and decentralized autonomous organizations, along with AI, to offer a more comprehensive educational experience. In summary, the latest additions to the TinyTap platform reflect the growing trend of leveraging advanced technologies to improve and augment the educational experience. While the AI tools focus on making educational game development more efficient and adaptable, the integration of NFTs aims to diversify opportunities for educators in the realm of content distribution and value creation. Both initiatives offer a glimpse into the potential future of education, one increasingly influenced by technological advancements. Author\nPrevious Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "education",
      "Education",
      "Top Stories"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/20/blockchain-games-get-green-light-in-epic-games-store-policy-update/",
    "title": "Blockchain Games with ‘Adults-Only’ Ratings Get Green Light From Epic Games Store",
    "time": "December 20, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nGaming\nFeatured, Gaming\nBlockchain Games with ‘Adults-Only’ Ratings Get Green Light From Epic Games Store\nBy Isaac Chang December 20, 2023\nEpic Games Store, a major player in the gaming marketplace, has recently made a noteworthy policy change concerning blockchain games. This revision follows the recent removal of certain blockchain games from the store which had ‘Adults Only’ ratings because of their Blockchain and NFT usage. Policy Change and Exemption for Blockchain Games Since its inception in December 2018, and known for the Unreal Engine and Fortnite, the Epic Games Store provides a digital distribution service for PC and macOS. It features top games, software, and other digital content. The Epic Games Store has strict restrictions on games rated “Adults Only” (AO) by the Entertainment Software Rating Board (ESRB). However, the store has now made an exception for blockchain games classified as AO solely because they use blockchain technology. Source Epic Games Store According to Epic Games Store, “The Epic Games Store makes an exception for products in cases where an AO rating was applied solely due to the usage of blockchain or NFT technology. However, these products must comply with our Blockchain Technology Guidelines.” The policy update comes after blockchain games such as ‘Gods Unchained‘ and ‘Striker Manager 3’ were removed from the Epic Games Store, having been excluded for their AO ratings from the ESRB, as per the store’s former no AO-rated games policy. This change shows the store’s evolving approach to these games. While adapting its stance on blockchain games, Epic Games reaffirms its stance against ‘gambling,’ ‘pornography,’ and ‘hateful content,’ which all game developers are required to uphold. Updated Guidelines for Blockchain Games Epic Games has introduced specific guidelines for blockchain games in their content policy. These guidelines outline various restrictions and requirements for publishers looking to feature their blockchain games on the store. Paid offers leveraging blockchain technology are not allowed, and products cannot use the store’s payment mechanism. Furthermore, links to blockchain, NFT, or cryptocurrency marketplaces are prohibited on store pages. Additionally, blockchain technology products cannot be made available to users in China and South Korea and must not facilitate gambling with traditional or digital currency. The store also reserves the right to remove products leveraging blockchain technology based on market actions that negatively impact players. The updated policy by the Epic Games Store reflects the growing acceptance and recognition of blockchain games and their unique characteristics. By adapting its guidelines, the store acknowledges blockchain technology’s increasing influence and potential in the digital gaming sector while also maintaining its important stance on AO content. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Featured",
      "Gaming"
    ]
  },
  {
    "url": "https://nftnewstoday.com/2023/12/21/oasys-joins-forces-with-datachain-and-toki-to-advance-inter-blockchain-communication/",
    "title": "Oasys Joins Forces with Datachain and TOKI to Advance Inter-Blockchain Communication",
    "time": "December 21, 2023",
    "content": "\nHome Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact Menu Home Categories Art Collectibles Education Gaming Metaverse Music Web3 About Contact\nSearch Search Close this search box.\nSubscribe It’s Free\nGaming\nGaming, Top Stories\nOasys Joins Forces with Datachain and TOKI to Advance Inter-Blockchain Communication\nBy David Andrews December 21, 2023\nOasys, a leading blockchain platform in blockchain gaming, has announced a dynamic partnership to improve the interoperability of Web3 games developed on its network. Its collaboration with Datachain and Toki is the latest step in a series of high-profile partnerships focusing on expanding its ecosystem. Moreover, the move aligns with its “Dragon Update” and is the first stage of Oasys’ three core pillars: ‘interoperability, ecosystem, and killer content’. Enhancing Interoperability with Datachain and TOKI Oasys aims to harness interoperability to enable distinct blockchain networks within its ecosystem to facilitate cross-chain transactions, creating a more connected and functional gaming environment. Datachain, known for innovative blockchain research and development, is bringing its Inter-Blockchain Communication (IBC) technology expertise to the partnership. With multiple grants from the Interchain Foundation, Datachain offers expert knowledge in IBC with access to a network of 100+ chains. TOKI, which develops cross-chain bridges using IBC, will help Oasys maximize this protocol to improve the game user experience. Daiki Moriyama, Director of Oasys, emphasizes the importance of unique blockchain-enabled gaming experiences. “At Oasys, we passionately believe that the future of blockchain gaming hinges on providing unique experiences that are only possible through blockchain technology,” he said. In the announcement, Daiki highlights the crucial role of interoperability in Web3 gaming: “One of the key elements to achieving this will be the interoperability of games – for example: giving players the ability to make single-click, cross-chain transactions across multiple networks. By collaborating with Datachain and TOKI and integrating IBC, the go-to standard for web3 interoperability, we will deliver for gamers globally.” Leveraging the Power of IBC Amidst the harsh climate of the cryptocurrency market recently, this collaboration highlights a pattern of Web3 players coming together to progress with a user-centric focus. Beyond enhanced interoperability, Oasys acknowledges the importance of IBC’s permissionless framework, enabling secure cross-chain transactions with built-in responsive features. Oasys is a game-optimized blockchain, and the incorporation of an inter-blockchain messaging protocol enables the settlement of NFTs across different blockchains, minimizing friction and enhancing the overall gaming experience for users. Furthermore, this partnership opens up the possibility of applications on Oasys using stablecoins from various blockchains, thanks to integration with Progmat Coin. Progmat is a digital asset infrastructure provider and a mutual partner of Datachain and TOKI. Oasys boasts a scalable Layer 1 hub complemented by a dedicated Layer 2 that utilizes Ethereum’s advanced Layer 2 scaling technology. As a gaming-specific blockchain, they are supported by first-class gaming names like SEGA, Bandai Namco, Square Enix, and Ubisoft. They play a vital role as network validators, further solidifying Oasys’ position in the gaming blockchain sector. Author\nPrevious Article Next Article\n\nArticles You Might Like\n\n\nCardano Foundation and Petrobras Unite for Blockchain Education Initiative Read More » Veyond Metaverse’s Meta Quest 3 Fusion: A New Era in Digital Surgery Read More »\nShare This Article\n\n\nMore Stories\n\nYuga Labs Introduces CryptoPunks721 Wrapper To Facilitate NFT Trading Anthony Nguyen December 22, 2023 Read More Animoca Brands Embraces Interoperability in Gaming Mia Patel December 22, 2023 Read More\nSubscribe to our newsletter!\nPlease enable JavaScript in your browser to complete this form. Name * First Last Email Confirmation * By ticking this box I declare that I wish to receive NFT News Today newsletter. Subscribe Now\n\nAbout Us Contact Privacy\nHome Gaming Metaverse Collectibles Web3\n\nFacebook Twitter Youtube\n",
    "keywords": [
      "Top Stories",
      "Gaming"
    ]
  }
]